package oskerko.part5.task05;

/*5. Сортировка вставками. Дана последовательность чисел а1, а2...аn. Требуется
переставить числа в порядке возрастания. Делается это следующим образом. Пусть
a1,a2,...an - упорядоченная последовательность, т. е. a1<=a2<=...<=an. Берется следующее
число a1+n и вставляется в последовательность так, чтобы новая последовательность была
тоже возрастающей. Процесс производится до тех пор, пока все элементы от n +1 до n не
будут перебраны. Примечание. Место помещения очередного элемента в отсортированную
часть производить с помощью двоичного поиска. Двоичный поиск оформить в виде
отдельной функции.*/

public class Task05 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
